sim-sender/src/main/resources/crf_141_b1_001/CRF_141_B1_001_023.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<Body>
		<d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2">
			<exchange>
				<supplierIdentification>
					<country>fr</country>
					<nationalIdentifier>DATEX2_DIRIF</nationalIdentifier>
				</supplierIdentification>
				<subscription>
					<operatingMode>operatingMode1</operatingMode>
					<subscriptionStartTime>2017-04-04T13:42:13Z</subscriptionStartTime>
					<subscriptionState>active</subscriptionState>
					<updateMethod>allElementUpdate</updateMethod>
					<target>
						<address>not used</address>
						<protocol>not used</protocol>
					</target>
				</subscription>
			</exchange>
			<payloadPublication xsi:type="SituationPublication" lang="fr">
				<publicationTime>2017-04-14T13:29:15Z</publicationTime>
				<publicationCreator>
					<country>fr</country>
					<nationalIdentifier>DATEX2_DIRIF</nationalIdentifier>
				</publicationCreator>
				<situation version="1" id="CRF_141_B1_023">
					<overallSeverity>high</overallSeverity>
					<headerInformation>
						<confidentiality>noRestriction</confidentiality>
						<informationStatus>real</informationStatus>
						<urgency>normalUrgency</urgency>
					</headerInformation>
					<situationRecord version="1" id="CRF_141_B1_001_023" xsi:type="MaintenanceWorks">
						<situationRecordCreationTime>2017-04-14T13:28:17Z</situationRecordCreationTime>
						<situationRecordObservationTime>2017-12-15T08:56:17Z</situationRecordObservationTime>
						<situationRecordVersionTime>2017-04-14T13:28:17Z</situationRecordVersionTime>
						<situationRecordFirstSupplierVersionTime>2017-04-14T13:28:17Z</situationRecordFirstSupplierVersionTime>
						<probabilityOfOccurrence>certain</probabilityOfOccurrence>
						<severity>high</severity>
						<source>
							<sourceType>otherInformation</sourceType>
							<reliable>true</reliable>
						</source>
						<validity>
							<validityStatus>definedByValidityTimeSpec</validityStatus>
							<validityTimeSpecification>
								<overallStartTime>2017-04-13T13:28:17Z</overallStartTime>
							</validityTimeSpecification>
						</validity>
						<impact>
							<capacityRemaining>66</capacityRemaining>
							<numberOfOperationalLanes>2</numberOfOperationalLanes>
							<originalNumberOfLanes>3</originalNumberOfLanes>
							<trafficConstrictionType>lanesBlocked</trafficConstrictionType>
						</impact>
						<generalPublicComment>
							<comment>
								<values>
									<value lang="fr"/>
								</values>
							</comment>
						</generalPublicComment>
						<nonGeneralPublicComment>
							<comment>
								<values>
									<value lang="fr">Entretien</value>
								</values>
							</comment>
						</nonGeneralPublicComment>
						<groupOfLocations xsi:type="Point">
							<supplementaryPositionalDescription>
								<locationDescriptor>atRestArea</locationDescriptor>
								<affectedCarriagewayAndLanes>
									<carriageway>connectingCarriageway</carriageway>
									<lane>middleLane</lane>
								</affectedCarriagewayAndLanes>
							</supplementaryPositionalDescription>
							<pointAlongLinearElement>
								<directionRelativeAtPoint>aligned</directionRelativeAtPoint>
								<linearElement>
									<roadNumber>A0004</roadNumber>
								</linearElement>
								<distanceAlongLinearElement xsi:type="DistanceFromLinearElementReferent">
									<distanceAlong>600</distanceAlong>
									<fromReferent>
									<referentIdentifier>94PR2D</referentIdentifier>
									<referentType>referenceMarker</referentType>
									</fromReferent>
								</distanceAlongLinearElement>
							</pointAlongLinearElement>
						</groupOfLocations>
						<mobility>
							<mobilityType>stationary</mobilityType>
						</mobility>
						<roadMaintenanceType>sweepingOfRoad</roadMaintenanceType>
					</situationRecord>
				</situation>
			</payloadPublication>
		</d2LogicalModel>
	</Body>
</Envelope>